class Urls:
    SCOOTER_MAIN = "https://qa-scooter.praktikum-services.ru/"
    DZEN_MAIN = "https://dzen.ru/"

class AnswerTexts:

    HOW_MUCH_ANSWER_TEXT = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    WANT_MORE_SCOOTERS_ANSWER_TEXT = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    TIME_CALCULATION_ANSWER_TEXT = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    ORDER_TODAY_ANSWER_TEXT = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    ORDER_EXTEND_ANSWER_TEXT = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    CHARGE_ANSWER_TEXT = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    ORDER_CANCELLATION_ANSWER_TEXT = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    NOT_IN_MOSCOW_ANSWER_TEXT = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class OrderData:

    NAME_1 = "Юрий"
    NAME_2 = "Ксюша"

    SURNAME_1 = "Ханалайнен"
    SURNAME_2 = "Чугунова"

    ADDRESS_1 = "Новочеркасский пр-т, д. 25"
    ADDRESS_2 = "пр-т Энгельса д. 139"

    PHONE_NUMBER_1 = "+79322276538"
    PHONE_NUMBER_2 = "+79990934582"

    COMMENT_1 = "Будь как дома, путник, я ни в чем не откажу!"
    COMMENT_2 = "Множество историй, коль желаешь, расскажу!"

